In [26]:
import pandas as pd 
import numpy as np
from recordlinkage.preprocessing import clean
from recordlinkage.preprocessing import phonetic
from recordlinkage.preprocessing import phonenumbers
import re

In [12]:
df=pd.read_csv("names_adress.csv")

In [13]:
df.head()

,name,phone_number,occupation,address
0,1. Rachel Green,1(613)555 0149,buyer (fashion),"90 Bedford Street, Apt 20"
1,2. Ross Geller,+1-613-555-0138,paleontogist,"100 Grove Street, Apartment 16"
2,3. Mönica Geller,16135550185,Chef,"90 Bedford Street, Apt 20"
3,4. Chandler BING,1 613 555 0161,???,"90 Bedford Street, Apt 19"
4,5. Pheobe Buffay,1(613)5550114,musician,"5 Morton Street, Apt. 14"

In [14]:
df["name"]=clean(df["name"])
df["occupation"]=clean(df["occupation"])
df["phone_number"]=phonenumbers(df["phone_number"])

In [20]:
df[["street","house_no"]]=df["address"].str.split(",",expand=True)
df.drop(columns="address",inplace=True)

In [24]:
# Lets replace the empty cell with NaN
df.replace("",np.NaN,inplace=True)

In [27]:
# Lets clean the name using regular expression:
df["name"]=df["name"].apply(lambda x: re.sub(r"\d\s","",x))

In [33]:
df[["first_name","surname"]]=df["name"].str.split(" ",expand=True)
df.drop(columns="name",inplace=True)

In [34]:
df

,phone_number,occupation,street,house_no,first_name,surname
0,16135550149,buyer,90 Bedford Street,Apt 20,rachel,green
1,+16135550138,paleontogist,100 Grove Street,Apartment 16,ross,geller
2,16135550185,chef,90 Bedford Street,Apt 20,mnica,geller
3,16135550161,NaN,90 Bedford Street,Apt 19,chandler,bing
4,16135550114,musician,5 Morton Street,Apt. 14,pheobe,buffay
5,16135550148,actor,90 Bedford Street,Apt 19,joseph,tribbiani

In [37]:
df["phonetische_kodierung"]=phonetic(df["surname"],"soundex")

In [42]:
df

,phone_number,occupation,street,house_no,first_name,surname,phonetische_kodierung
0,16135550149,buyer,90 Bedford Street,Apt 20,rachel,green,G650
1,+16135550138,paleontogist,100 Grove Street,Apartment 16,ross,geller,G460
2,16135550185,chef,90 Bedford Street,Apt 20,mnica,geller,G460
3,16135550161,NaN,90 Bedford Street,Apt 19,chandler,bing,B520
4,16135550114,musician,5 Morton Street,Apt. 14,pheobe,buffay,B100
5,16135550148,actor,90 Bedford Street,Apt 19,joseph,tribbiani,T615